app/controllers/games_controller.rb

  def index
  	@games=Game.all
---
SELECT "games".* FROM "games"

  def show
    @games=Game.all
  	@game=Game.find(params[:id])
---
SELECT "games".* FROM "games"
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def score
    @game=Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]